[{"user":"U0B0A0NAX","type":"message","subtype":"channel_join","text":"<@U0B0A0NAX|seekarete> has joined the channel","ts":"1443046754.000002"},{"user":"U0B0A0NAX","purpose":"Fitness goals, methods, progress, and events","type":"message","subtype":"channel_purpose","text":"<@U0B0A0NAX|seekarete> set the channel purpose: Fitness goals, methods, progress, and events","ts":"1443046754.000003"},{"user":"U0A6V6PHS","inviter":"U0B0A0NAX","type":"message","subtype":"channel_join","text":"<@U0A6V6PHS|bgillespie> has joined the channel","ts":"1443046802.000004"},{"user":"U0A6WE73P","inviter":"U0B0A0NAX","type":"message","subtype":"channel_join","text":"<@U0A6WE73P|mbyron> has joined the channel","ts":"1443046803.000005"},{"user":"U0A6T0LNT","inviter":"U0B0A0NAX","type":"message","subtype":"channel_join","text":"<@U0A6T0LNT|brandon> has joined the channel","ts":"1443046803.000006"},{"type":"message","user":"U0B0A0NAX","text":"I guess I'll start by showing all you civilians how Uncle Sam evaluates soldiers: \n2 minutes of Push-ups (without lifting your hands)\n2 minutes of Sit-ups (without resting in the down position) \n2-mile run (flat\/flat-ish course)\nThose figures + age determine your PT score. Do it on your own for fun: <http:\/\/apftcalculator.com\/>","ts":"1443047129.000007"},{"user":"U0B061R88","inviter":"U0B0A0NAX","type":"message","subtype":"channel_join","text":"<@U0B061R88|lindsayad> has joined the channel","ts":"1443047200.000008"},{"user":"U0B6U4WVC","inviter":"U0B0A0NAX","type":"message","subtype":"channel_join","text":"<@U0B6U4WVC|connorgalleher> has joined the channel","ts":"1443047200.000009"},{"user":"U0A6Z2QE4","inviter":"U0A6T0LNT","type":"message","subtype":"channel_join","text":"<@U0A6Z2QE4|bpl> has joined the channel","ts":"1443047399.000010"},{"user":"U0A6TU7L3","inviter":"U0A6T0LNT","type":"message","subtype":"channel_join","text":"<@U0A6TU7L3|mariagillespie> has joined the channel","ts":"1443047399.000011"},{"user":"U0AVA8KDH","inviter":"U0A6T0LNT","type":"message","subtype":"channel_join","text":"<@U0AVA8KDH|sean.mac> has joined the channel","ts":"1443047399.000012"},{"type":"message","user":"U0A6T0LNT","text":"okay, so let's say I'm Normal Joe and I roll off the couch and max out at 20 total push-ups and... a sit-up every two seconds","ts":"1443047511.000013"},{"type":"message","user":"U0A6T0LNT","text":"and I manage an eight-mile mile","ts":"1443047528.000014"},{"type":"message","user":"U0A6T0LNT","text":"oh okay, this thing is a calculator...","ts":"1443047538.000015"},{"type":"message","user":"U0A6T0LNT","text":"huh, so that's a fail","ts":"1443047561.000016"},{"type":"message","user":"U0A6T0LNT","text":"okay, so this isn't totally trivial","ts":"1443047565.000017"},{"type":"message","user":"U0B0A0NAX","text":"Yeah; I should add that while the total is out of 300, each event is on a 100-point scale and you must get at least 60 points in each event.","ts":"1443047617.000018"},{"type":"message","user":"U0A6T0LNT","text":"I guess I'm biased by my activities, but I'm surprised how many points that gives me in sit-ups (76) and run (71) versus push-ups (only 40)","ts":"1443047652.000019"},{"type":"message","user":"U0A6T0LNT","text":"also, what the heck are the functions that get me from push-ups → score?","ts":"1443047920.000020"},{"type":"message","user":"U0A6T0LNT","text":"so I need 39 push-ups to pass the push-up portion, which seems like a lot","ts":"1443047953.000021"},{"type":"message","user":"U0A6T0LNT","text":"compared to an 8:30 mile over two miles","ts":"1443047981.000022"},{"type":"message","user":"U0A6T0LNT","text":"annnnd 45 sit-ups","ts":"1443048012.000023"},{"type":"message","user":"U0A6T0LNT","text":"I would difficulty rank that: sit-ups &lt; run &lt; push-ups","ts":"1443048086.000024"},{"type":"message","user":"U0A6T0LNT","text":"do you know how people typically score?","ts":"1443048096.000025"},{"type":"message","user":"U0A6T0LNT","text":"do you get bonus nachos for outperforming?","ts":"1443048317.000026"},{"type":"message","user":"U0B0A0NAX","text":"All over the map and varies by job and unit too.  Active duty parachute units are probably the most fit. The reserves as a whole seems to suffer because there isn't mandatory exercise time 5 days a week for us.","ts":"1443048419.000027"},{"type":"message","user":"U0A6T0LNT","text":"what happens if you fail?","ts":"1443048434.000028"},{"type":"message","user":"U0B0A0NAX","text":"Depends on the time of year and reason for the test. Some schools require a PT score to apply\/attend.  For normal guys, if you  fail multiple tests in you can be kicked out within maybe 3 months. It's a matter of command motivation and paperwork. If they're about to deploy or you demonstrate improvement, they'll be more lenient. If you have rank\/influence you can avoid being tested for years.","ts":"1443048750.000029"},{"type":"message","user":"U0B0A0NAX","text":"By regulation, you only need one passing PT score per year, but some units do it more frequently.","ts":"1443048799.000030"},{"type":"message","user":"U0A6T0LNT","text":"I'm surprised there's no pull-up","ts":"1443048808.000031"},{"type":"message","user":"U0B0A0NAX","text":"Well this is just the Army Physical Fitness Test that is applied to everyone. Its main virtue is that it's very scalable, requires no equipment, and almost no training to administer. For Airborne folks there is a pull-up requirement (something about operating the parachutes). For many schools there are ruck marches with different weight\/distance\/time requirements. I think the Air assault standard is 35 lbs\/12 miles\/within 3 hours.","edited":{"user":"U0B0A0NAX","ts":"1443580155.000000"},"ts":"1443049435.000032"},{"type":"message","user":"U0B0A0NAX","text":"There is an unofficial \"extended scale\" that you \"unlock\" after you score over 100 in all 3 events.","ts":"1443049828.000033"},{"type":"message","user":"U0A6T0LNT","text":"ohhhhh","ts":"1443050296.000034"},{"type":"message","user":"U0A6T0LNT","text":"is this used in advancement?","ts":"1443050302.000035"},{"type":"message","user":"U0B0A0NAX","text":"Can be. If there are more eligible candidates than open positions, then marksmanship and PT score are considered.","ts":"1443052797.000036"},{"user":"U0B7LF484","inviter":"U0A6T0LNT","type":"message","subtype":"channel_join","text":"<@U0B7LF484|bwoolston> has joined the channel","ts":"1443069355.000037"},{"type":"message","user":"U0A6Z2QE4","text":"And this is all army only right? Each branch has different though similar requirements (Navy - Marines lowest?)","ts":"1443071242.000038"},{"type":"message","user":"U0A6WE73P","text":"Interesting!  The run and push-up depend on gender, but sit-ups are not adjusted at all.","ts":"1443105441.000039"},{"type":"message","user":"U0A6WE73P","text":"So I pass decently well as a lady, but fail as a dude.","ts":"1443105457.000040"},{"type":"message","user":"U0A6WE73P","text":"This is going to sound pretty clueless but what are the current restrictions for women in the military?  As far as I know they are still disallowed from active combat, but there are still lots of women who serve in \"non-active\" things that still seem pretty active to me (like driving a van in a combat zone, but not being actually sent out on the ground).","ts":"1443105684.000041"},{"type":"message","user":"U0B0A0NAX","text":"<@U0A6Z2QE4> Yeah. I know the Marines do crunches instead of sit-ups and have a pull-up requirement.","ts":"1443111427.000042"},{"type":"message","user":"U0B0A0NAX","text":"<@U0A6WE73P> You're generally correct; infantry, artillery, cavalry, armor (tanks), combat engineering, and Special Forces are still closed to enlisted females. There are a few female Engineer Officers leading combat engineers, though.","ts":"1443111771.000043"},{"type":"message","user":"U0AVA8KDH","text":"Running portion: DESTROYED. Others ... ehhh ... ;D","ts":"1443579699.000002"},{"type":"message","user":"U0B0A0NAX","text":"I have no idea if this is actually employed by SOCOM units, but it's an interesting benchmark: <http:\/\/www.refactortactical.com\/blog\/special-forces-pt-test-upper-body-round-robin>","attachments":[{"service_name":"RE Factor Tactical","title":"Special Forces PT Test (Upper Body Round Robin)","title_link":"http:\/\/www.refactortactical.com\/blog\/special-forces-pt-test-upper-body-round-robin","text":"Get the UBRR Eight Week Workout E-Book by Stew Smith at <http:\/\/www.refactortactical.com\/Upper-Body-Round-Robin-UBRR-p\/ssubrr.htmThe> Upper Body Round Robin AKA the UBRR is a commonly used physical fitness test among many Tier I and Tier II Special Operations Units. This pt test goes well beyond the typical scoring of pushups, sit-ups and a run. UPPER BODY ROUND ROBIN (UBRR)Bench PressPushupsSitupsPull-upsDipsRope ClimbKipp UpShuttle Run5 Mile Run\/RuckUBRR SCORING SYSTEMSpecial Instruction:As soon as an individual finishes one exercise, he must start the next exercise in no more than 10 minutes.There is only one common standard for all age groups.Only one attempt is allowed per participant at each stationIn order to pass the UBRR, participants must achieve the following:Pass all events with at least the minimum score, and Receive at least 1100 total points from all the events combined.Bench press:Time: No time limit.Minimum: 6 repetitions with the individuals body weight minus 20 percent of the individuals body weight is the minimumScore: The minimum is 100 points. Each additional repetition above the minimum is worth 3 pointsThe correct position is: The individual will lay flat (supine) on the bench, feet flat on the floor, shoulder blades, head, and buttocks in contact with the bench. Hands are approximately shoulder width apart.A correct repetition is: On the command, \"Go\", the bar is pushed off the supports (first repetition only), and arms are extended fully to the locked position. Then the bar is lowered until it touches the chest, and then raised until the arms are fully extended, elbows locked.Grader position: The grader must be located to one side of the individual doing the exercise to ensure the feet stay flat on the floor, the buttocks, shoulder blades and head stay in contact with the bench, and the arms fully extended. The grader will notify the individual doing the exercise if the feet, buttocks, shoulder blades, or head lift do not maintain contact, or the arms don't fully extend. The repetition will not be counted after the second notification.Example : Individual weighs 180 pounds.Minimum weight: 180lbs-36lbs (20% of 180) = 144 lbsIndividual presses 144 lbs 15 times.Score = 100 points for minimum (6repetitions)9 repetitions over minimum x 3 points per repetition for a total of 27 additional points (9 x 3 = 27). Total score is 127 (100 points minimum and 27 points for additional points).<http:\/\/www.refactortactical.com\/Upper-Body-Round-Robin-UBRR-p\/ssubrr.htmPush-ups:Time>: 1 minuteMinimum: 40 pushups is the minimumScore: The minimum is 100 points. Each additional repetition above the minimum is worth 2 pointsThe correct position is: The back is generally straight, feet are up to 12 inches apart, hands are placed should width apart with arms extended and locked on a generally flat surfaceA correct repetition is: On the command, \"Go\", the body is lowered from the front leaning rest position until the chest (sternum area) touches a flat hand on the floor, then the body is raised until the arms are fully extended (locked).Grader position: The grader will have one hand on the floor and the other on one elbow of the individual doing the exercise. The grader will notify the individual doing the exercise if he needs to go lower or extend the arms fully, and will not count the repetition after the second notificationSit-ups:Time: 1 minuteMinimum: 40 sit-ups is the minimumScore: The minimum is 100 points. Each additional repetition above the minimum is worth 3 pointsThe correct position is: The individual lies flat (supine) on his back on a generally flat surface. The legs should have a 90 degree bend at the knees. Feet should be flat on the floor with no more than 12 inches in between them, and at the same level as the upper body. Fingers should be interlaced (one or more and at any part of the finger) and placed behind the head.A correct repetition is: On the command \"Go\" the individual raises his upper body by bending at the pelvis until the spine (base of the neck) breaks or equals the vertical plane (lower spine). Then he lowers his body until the shoulder blades touch the floor. The person holding the feet may secure them by any means, but will not be in the way or assist in the repetition.Grader position: The grader will be positioned perpendicular to the individual doing the exercise. The grader will notify the individual doing the exercise if he needs to go higher or interlace the fingers and will not count the repetition after the second notification.Pull-ups:Time: No time limitMinimum: 6 pull-ups is the minimumScore: The minimum is 100 points. Each additional repetition above the minimum is worth 3.5 pointsThe correct position is: The bar will be grasped with hands shoulder width apart, knuckles facing the individual. The individual will hang from the bar so that the arms are fully extended (starting position).A correct position is: On the command \"Go\", pull with the arms, raising the body until the chin is higher than the bar (head can be level or tilted back). Then the individual will lower his body until he is hanging with arms fully extended. The knees may be bent so the feet are behind the body, but the knees cannot come up in the front or kip in any way that would assist in the repetition.Grader position: The grader will stand 18 inches in front of the person doing the exercise and will count out loud. If the individual touches the grader with any part of this body, that repetition will not count. The grader will notify the individual doing the exercise if he needs to go higher or lock the arms, and will not count the repetition after the first notification.<http:\/\/www.refactortactical.com\/Upper-Body-Round-Robin-UBRR-p\/ssubrr.htm> Dips:Time: No time limit.Minimum: 10 dips is the minimumScore: The minimum is 100 points. Each additional repetition above the minimum is worth 2.5 pointsThe correct position is: The body will be fully supported on the dip bar, arms fully extended and locked. Legs may be bent or straight, and feet may be crossed.A correct repetition is: On the command \"Go\", lower the body until the upper arms are parallel with the dip bar, and then press upwards with the arms until the arms are fully extended, elbows locked.Grader position: The grader will be positioned to one side of the individual to ensure the upper arms are at least parallel with the dip bar in the lower position, and the arms become fully locked in the up position. The grader will notify the individual if he fails the go low enough, or if the elbows don't lock. He will not count the repetition after the second notification.Rope climb:Time: No time limitMinimum: Individual mist climb the rope (using any technique) until he can touch the designate height (the green tape at 20 feet) on the rope. Individual will wear a 20 lb vest during this exercise.Score: This is a GO\/NO GO event, and no points will be awarded.Kipp-upTime: One minute time limitMinimum: Six kipp ups is the minimum.Score: The minimum is 100 points. Each additional repetition above the minimum is worth 3.5 pointsThe correct position is: The individual will position himself underneath the pull-up bar as if he were doing a regular pull-up. Do a left or right facing movement so the pull-up bar is now perpendicular to the individual. Grasp the bar with palms facing each other, no more than 5\" apart, arms fully extended and body hanging without touching the ground.The correct repetition is: On the command, \"Go\", pull up with the arms and torso, raising the feet and legs, one leg on either side of the bar, until the heels touch above the bar, with the bar between the legs. Then lower the legs until the arms and legs are fully extend in the starting position. This is one repetition.Grader position: The grader will be located to one side or the other of the individual to ensure the arms and legs are fully extended to start each repetition. The grader will also ensure that the heels touch above the bar on each repetition. The grader will notify the individual if the individual fails to fully extend the arms or legs or fails to touch the heels above the bar. He will not count the repetition after the second notification.Shuttle Run:Time: 24 seconds is the maximum timeScore: The maximum is worth 100 points. Each full 0.1 second under the maximum is worth 2 points.A correct course is: The course will be a pre-marked 25 meter running lane that is flat and without obstructions. Easily visible lines on the ground will indicate the starting point and the 25 meter point.A correct shuttle run is: On the command \"Go\", the individual doing the exercise will leave the start point and run down to the far end of the course, pick up a block, return to the start point and put that block down behind the line. Then he will pick up a different block, return to the far end, put that block down behind the line, pick up a different block and return to the starting line. The blocks must be placed behind the lines and carried by hand.Grader position: The grader will be positioned behind the starting line, and must use a watch that measures tenths of a second.Example: Individual's time = 22.4 secondsTime is 24 seconds or less (maximum) = 100 pointsTotal time under 24 seconds is sixteen 1\/10th second incrementsScore = 100 (maximum time) + (16 x 2) for tenths of a secondunder the maximum for a total score of 132 pointsFive Mile Run:Time: Maximum time is 40 minutesScore: The maximum is worth 100 points. Every full 5 second increment under the maximum time is worth 2 pointsA correct course is: The course will be 5 miles in distance, with a paved (or similar) surface, generally flat and without obstacles. The start and finish line will be the same.A correct five mile run is: On the command \"Go\", the individual will begin to run at his own pace, and continue through the course until he crosses the finish line. This exercise must be completedGrader position: The grader will be located at the start\/finish line, and will begin the time at the command \"Go\". He will call off the finish times as runners cross the finish line, and he will not stop his watch until the last runner has completed the run.Example: Individuals time = 36:17Time is 40 minutes or less (maximum) = 100 pointsTotal time under 40 minutes is 223 seconds44 full 5 second increments x 2 points per increment = 88 points(22 x 3 = 88)Score = 100 (maximum time) + 88 (points for 5 second increments) for a totalScore of 188 points.5 Mile Run OR Five Mile Rucksack March: Time: The maximum time is 75 minutes for the ruck, 40 minutes for the run. Score: The maximum score is worth 100 points. Every full time increment of 15 seconds under the maximum is worth 2 points.Equipment: The rucksack must weigh no less than 40 pounds dry. Uniform can be pants or shorts with boots.A correct course is: The course will be 5 miles in distance, with a hard, solid surface, generally flat without obstacles. The start and finish line will be the same.A correct five mile rucksack march is: Individual will begin at the start line, and at the command \"Go\", will begin the ruckmarch at his own pace and continue through the course until he crosses the finish line. This entire exercise must be completed with the rucksack, and un-aided. Running is authorized.Grader position: The grader will be located at the start\/finish line, and will start the time at the command \"Go\". He will call off the times as participants cross the finish line, and he will not stop the time until the last individual completes the rucksack march.Example: Individuals time is 52 minutes 35 seconds.Time is 75 minutes or less (maximum) = 100 pointsTotal time under 75 minutes is 22 minutes and two 15 full seconds22 minutes x 4 (15 second increments) = 88 + 1 (15 full second)89 x 2 = 178Score of 178 points<http:\/\/www.refactortactical.com\/Upper-Body-Round-Robin-UBRR-p\/ssubrr.htm> Click to Purchase the UBRR E-Workout BookLooking to improve your UBRR Score? Try the Eight Week Workout guide by Stew Smith available for immediate download at <http:\/\/www.refactortactical.com\/Upper-Body-Round-Robin-UBRR-p\/ssubrr.htm>","fallback":"RE Factor Tactical: Special Forces PT Test (Upper Body Round Robin)","from_url":"http:\/\/www.refactortactical.com\/blog\/special-forces-pt-test-upper-body-round-robin","id":1}],"ts":"1444509004.000002"}]